import sys
import io

sys.stdout = io.TextIOWrapper(sys.stdout.detach(), encoding = 'utf-8')
sys.stderr = io.TextIOWrapper(sys.stderr.detach(), encoding = 'utf-8')

import random
#200개
arr = ["#엔터테인먼트", "#뉴스", "#스포츠", "#음악", "#영화", "#텔레비전", "#게임", "#유명인사", "#건강", "#패션", "#뷰티", "#요리", "#여행", "#기술", "#자동차", "#과학", "#환경", "#정치", "#경제", "#코로나19", "#피트니스", "#독서", "#만화", "#애완동물", "#사회", "#교육", "#블로그", "#소셜미디어", "#쇼핑", "#페스티벌", "#예술", "#연예인", "#식품", "#야외활동", "#취미", "#스타트업", "#스마트폰", "#트렌드", "#역사", "#문화", "#인터넷", "#과학기술", "#음식", "#운동", "#여성", "#남성", "#가족", "#친구", "#컴퓨터", "#프로그래밍", "#디자인", "#코딩", "#비즈니스", "#투자", "#주식", "#부동산", "#금융", "#자금", "#부모", "#아이", "#육아", "#결혼", "#연애", "#이별", "#건축", "#인테리어", "#가구", "#요가", "#명상", "#사진", "#카메라", "#모바일앱", "#자기계발", "#공부", "#어학", "#영어", "#일본어", "#중국어", "#외국어", "#여행지", "#호텔", "#항공", "#바다", "#산", "#호수", "#자연", "#동물", "#생물학", "#물리학", "#화학", "#수학", "#심리학", "#사회학", "#국제정치", "#연예계", "#배우", "#가수", "#스포츠선수", "#올림픽", "#월드컵", "#테크놀로지", "#스마트홈", "#로봇", "#모바일게임", "#스포츠영화", "#호러영화", "#코미디", "#드라마", "#로맨스", "#범죄", "#환경보호", "#재활용", "#기후변화", "#정치인", "#선거", "#정책", "#경제학", "#금융시장", "#투자전략", "#예술가", "#전시회", "#미술", "#문학", "#문학작품", "#사용자경험", "#소프트웨어", "#앱개발", "#IT보안", "#인공지능", "#빅데이터", "#로봇공학", "#우주", "#우주탐사", "#로켓", "#천체관측", "#신기술", "#인터넷오브락", "#가상현실", "#3D프린팅", "#음악페스티벌", "#컨서트", "#음악가", "#음악밴드", "#힙합", "#팝뮤직", "#록뮤직", "#클래식음악", "#재즈", "#블루스", "#컨트리음악", "#레게", "#펑크록", "#메탈", "#전자음악", "#발라드", "#댄스음악", "#컨템포러리댄스", "#발레", "#힙합댄스", "#노래", "#음악프로듀서", "#음악비디오", "#MTV", "#그래미어워드", "#오스카상", "#종합격투기", "#농구", "#야구", "#축구", "#테니스", "#골프", "#수영", "#스키", "#스케이트보드", "#사이클링", "#레이싱", "#육상", "#체조", "#무용", "#탁구", "#볼링", "#롤러스케이트", "#얼라이언스", "#게임컨솔", "#모바일게임", "#온라인게임", "#카드게임", "#보드게임", "#비디오게임", "#게임개발", "#게임캐릭터", "#게임커뮤니티", "#게임대회", "#유명게임", "#모델", "#배우모델", "#패션모델", "#아름다움", "#메이크업", "#피부관리", "#헤어스타일", "#헤어컬러", "#미용실", "#스킨케어", "#스파", "#마사지", "#에스테틱", "#요가스튜디오", "#요가매트", "#피트니스클럽", "#운동화", "#운동복", "#다이어트", "#건강식품", "#식단", "#요리책", "#요리조리", "#디저트", "#피자", "#스시", "#커피", "#와인"]

tag = """#인기검색어#트렌드#최신뉴스#뉴스업데이트#히트뉴스#인터넷트렌드#소셜미디어#인스타그램#페이스북#트위터#유튜브#틱톡#영화#TV쇼#음악#연예뉴스#스포츠#게임#테크뉴스#과학#건강#여행#패션#뷰티#푸드#레시피#요리#운동#다이어트#비즈니스#경제#주식#부동산#투자#스타트업#인플루언서#마케팅#블로그#포드트렌드#사회이슈#환경#기후변화#정치#선거#국제뉴스#인권#사회운동#미국#중국#러시아#유럽#아시아#아프리카#남미"""
r_no = random.sample(range(0,200),50)
for i in r_no:
    tag = tag + arr[i]
print(tag)
